// 输入 无符号整数 长度32位，二进制串形式，输出1的个数
/**
 * 
输入：n = 11 (控制台输入 00000000000000000000000000001011)
输出：3
解释：输入的二进制串 00000000000000000000000000001011 中，共有三位为 '1'。

来源：力扣（LeetCode）
链接：https://leetcode.cn/problems/er-jin-zhi-zhong-1de-ge-shu-lcof
著作权归领扣网络所有。商业转载请联系官方授权，非商业转载请注明出处。
 */
var hammingWeight = function (n) {
    let count = 0;
    while(n != 0) {
        n = n & (n - 1); 
        // 01 - 1 = 00  ; 01 & 00 = 00
        // 11 -1 = 10 ; 11 & 10 = 10
        // 10010 - 1 = 10001 ; 10010 & 10001 = 10000;
        // n = n & (n - 1) 可以消除最后一位 1
        count++;
    }
    return count;
};


var hammingWeight = function(n) {
    let count = 0
    for (let i = 0; i < 32; i++) { 
        count += (n >> i) & 1  // 移位操作符

        // 100001 >> 0 & 1  -> 100001 & 1 = 1
        // 100001 >> 1 & 1  -> 10000 & 1 = 0
        // 100001 >> 2 & 1  -> 1000 & 1 = 0
        // 100001 >> 5 & 1 ->  1 & 1 = 1
    }
    return count
};
